app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)
    @client.save

    if @client.save
---
INSERT INTO "clients" ("full_name", "email", "phone", "register_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "clients" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-08-24 17:22:23.528529"], ["updated_at", "2020-08-24 17:22:23.528529"]]

  def update
    @client = Client.find(params[:id])
    @client.update(client_params)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "clients" SET "phone" = ?, "register_date" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["phone", "+55 "], ["register_date", "2020-02-26"], ["updated_at", "2020-08-26 19:21:31.084794"], ["id", 10]]

   def destroy
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 2]]