app/controllers/contacts_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
   def new
    @client = Client.find(params[:client_id])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "contacts" ("name", "phone", "email", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "maria"], ["phone", "+5531983113771"], ["email", "debora@torresetorres.com"], ["client_id", 1], ["created_at", "2020-08-25 01:51:34.571266"], ["updated_at", "2020-08-25 01:51:34.571266"]]
---
  def create
    @contact = Contact.new(contact_params)
    @client = Client.find(params[:client_id])
    @contact.client = @client
    if  @contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "contacts" SET "full_name" = ?, "email" = ?, "phone" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["full_name", "Debora Torres"], ["email", "debora@torresetorres.com"], ["phone", "+5531983113771"], ["updated_at", "2020-08-26 19:11:11.194899"], ["id", 1]]
---
  def update
    @contact = Contact.find(params[:id])
    @contact.update(contact_params)

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 2]]
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy